{"CVE-2025-4512": {"description": "A vulnerability classified as problematic has been found in Inetum IODAS 7.2-LTS.4.1-JDK7/7.2-RC3.2-JDK7. Affected is an unknown function of the file /astre/iodasweb/app.jsp. The manipulation of the argument action leads to cross site scripting. It is possible to launch the attack remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.", "publish_date": "2025-05-10T19:15:55.223", "last_modified_date": "2025-05-10T19:15:55.223", "base_score": 5.0, "vector": "AV:N/AC:L/Au:N/C:N/I:P/A:N", "cvss_version": "2.0"}, "CVE-2025-4513": {"description": "A vulnerability classified as problematic was found in Catalyst User Key Authentication Plugin 20220819 on Moodle. Affected by this vulnerability is an unknown functionality of the file /auth/userkey/logout.php of the component Logout. The manipulation of the argument return leads to open redirect. The attack can be launched remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.", "publish_date": "2025-05-10T20:15:20.353", "last_modified_date": "2025-05-10T20:15:20.353", "base_score": 5.0, "vector": "AV:N/AC:L/Au:N/C:N/I:P/A:N", "cvss_version": "2.0"}, "CVE-2025-4514": {"description": "A vulnerability, which was classified as critical, has been found in Zhengzhou Jiuhua Electronic Technology mayicms up to 5.8E. Affected by this issue is some unknown functionality of the file /javascript.php. The manipulation of the argument Value leads to sql injection. The attack may be launched remotely. The exploit has been disclosed to the public and may be used.", "publish_date": "2025-05-10T20:15:20.540", "last_modified_date": "2025-05-10T20:15:20.540", "base_score": 6.5, "vector": "AV:N/AC:L/Au:S/C:P/I:P/A:P", "cvss_version": "2.0"}, "CVE-2025-4515": {"description": "A vulnerability, which was classified as problematic, was found in Zylon PrivateGPT up to 0.6.2. This affects an unknown part of the file settings.yaml. The manipulation of the argument allow_origins leads to permissive cross-domain policy with untrusted domains. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.", "publish_date": "2025-05-10T21:15:52.010", "last_modified_date": "2025-05-10T21:15:52.010", "base_score": 5.0, "vector": "AV:N/AC:L/Au:N/C:N/I:P/A:N", "cvss_version": "2.0"}, "CVE-2025-47814": {"description": "libpspp-core.a in GNU PSPP through 2.0.1 allows attackers to cause a heap-based buffer overflow in inflate_read (called indirectly from spv_read_xml_member) in zip-reader.c.", "publish_date": "2025-05-10T22:15:20.193", "last_modified_date": "2025-05-10T22:15:20.193", "base_score": 4.5, "vector": "CVSS:3.1/AV:L/AC:H/PR:N/UI:N/S:C/C:N/I:L/A:L", "cvss_version": "3.1"}, "CVE-2025-47815": {"description": "libpspp-core.a in GNU PSPP through 2.0.1 allows attackers to cause a heap-based buffer overflow in inflate_read (called indirectly from zip_member_read_all) in zip-reader.c.", "publish_date": "2025-05-10T22:15:20.357", "last_modified_date": "2025-05-10T22:15:20.357", "base_score": 4.5, "vector": "CVSS:3.1/AV:L/AC:H/PR:N/UI:N/S:C/C:N/I:L/A:L", "cvss_version": "3.1"}, "CVE-2025-47816": {"description": "libpspp-core.a in GNU PSPP through 2.0.1 allows attackers to cause an spvxml-helpers.c spvxml_parse_attributes out-of-bounds read, related to extra content at the end of a document.", "publish_date": "2025-05-10T22:15:20.507", "last_modified_date": "2025-05-10T22:15:20.507", "base_score": 2.9, "vector": "CVSS:3.1/AV:L/AC:H/PR:N/UI:N/S:U/C:N/I:N/A:L", "cvss_version": "3.1"}, "CVE-2025-47817": {"description": "In BlueWave Checkmate through 2.0.2 before b387eba, a profile edit request can include a role parameter.", "publish_date": "2025-05-10T22:15:20.657", "last_modified_date": "2025-05-10T22:15:20.657", "base_score": 8.8, "vector": "CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H", "cvss_version": "3.1"}, "CVE-2025-4525": {"description": "A vulnerability, which was classified as critical, has been found in Discord 1.0.9188 on Windows. Affected by this issue is some unknown functionality in the library WINSTA.dll. The manipulation leads to uncontrolled search path. The attack needs to be approached locally. The complexity of an attack is rather high. The exploitation is known to be difficult. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.", "publish_date": "2025-05-10T23:15:51.507", "last_modified_date": "2025-05-10T23:15:51.507", "base_score": 6.0, "vector": "AV:L/AC:H/Au:S/C:C/I:C/A:C", "cvss_version": "2.0"}, "CVE-2025-4526": {"description": "A vulnerability, which was classified as problematic, was found in Dígitro NGC Explorer 3.44.15. This affects an unknown part of the component Configuration Page. The manipulation leads to missing password field masking. It is possible to initiate the attack remotely. The vendor was contacted early about this disclosure but did not respond in any way.", "publish_date": "2025-05-11T01:15:52.000", "last_modified_date": "2025-05-11T01:15:52.000", "base_score": 4.0, "vector": "AV:N/AC:L/Au:S/C:P/I:N/A:N", "cvss_version": "2.0"}, "CVE-2025-47828": {"description": "Lumi H5P-Nodejs-library before 9.3.3 omits a sanitizeHtml call for plain text strings.", "publish_date": "2025-05-11T03:15:23.533", "last_modified_date": "2025-05-11T03:15:23.533", "base_score": 6.4, "vector": "CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:C/C:L/I:L/A:N", "cvss_version": "3.1"}, "CVE-2025-4527": {"description": "A vulnerability has been found in Dígitro NGC Explorer 3.44.15 and classified as problematic. This vulnerability affects unknown code of the component Password Transmission Handler. The manipulation leads to client-side enforcement of server-side security. The attack can be initiated remotely. The complexity of an attack is rather high. The exploitation appears to be difficult. The vendor was contacted early about this disclosure but did not respond in any way.", "publish_date": "2025-05-11T03:15:24.740", "last_modified_date": "2025-05-11T03:15:24.740", "base_score": 2.6, "vector": "AV:N/AC:H/Au:N/C:P/I:N/A:N", "cvss_version": "2.0"}, "CVE-2025-4528": {"description": "A vulnerability was found in Dígitro NGC Explorer up to 3.44.15 and classified as problematic. This issue affects some unknown processing. The manipulation leads to session expiration. The attack may be initiated remotely. The vendor was contacted early about this disclosure but did not respond in any way.", "publish_date": "2025-05-11T03:15:24.970", "last_modified_date": "2025-05-11T03:15:24.970", "base_score": 4.0, "vector": "AV:N/AC:L/Au:S/C:N/I:P/A:N", "cvss_version": "2.0"}, "CVE-2025-4529": {"description": "A vulnerability was found in Seeyon Zhiyuan OA Web Application System 8.1 SP2. It has been classified as problematic. Affected is the function Download of the file seeyon\\opt\\Seeyon\\A8\\ApacheJetspeed\\webapps\\seeyon\\WEB-INF\\lib\\seeyon-apps-m3.jar!\\com\\seeyon\\apps\\m3\\core\\controller\\M3CoreController.class of the component ZIP File Handler. The manipulation of the argument Name leads to path traversal. It is possible to launch the attack remotely. The exploit has been disclosed to the public and may be used.", "publish_date": "2025-05-11T04:15:17.933", "last_modified_date": "2025-05-11T04:15:17.933", "base_score": 4.0, "vector": "AV:N/AC:L/Au:S/C:P/I:N/A:N", "cvss_version": "2.0"}, "CVE-2025-4530": {"description": "A vulnerability was found in feng_ha_ha/megagao ssm-erp and production_ssm 1.0. It has been declared as problematic. Affected by this vulnerability is the function handleFileDownload of the file FileController.java of the component File Handler. The manipulation leads to path traversal. The attack can be launched remotely. The exploit has been disclosed to the public and may be used. This product is distributed under two entirely different names.", "publish_date": "2025-05-11T05:15:16.167", "last_modified_date": "2025-05-11T05:15:16.167", "base_score": 4.0, "vector": "AV:N/AC:L/Au:S/C:P/I:N/A:N", "cvss_version": "2.0"}, "CVE-2025-4531": {"description": "A vulnerability was found in Seeyon Zhiyuan OA Web Application System 8.1 SP2. It has been rated as critical. Affected by this issue is the function postData of the file ROOT\\WEB-INF\\classes\\com\\ours\\www\\ehr\\salary\\service\\data\\EhrSalaryPayrollServiceImpl.class of the component Beetl Template Handler. The manipulation of the argument payrollId leads to code injection. The attack may be launched remotely. The exploit has been disclosed to the public and may be used.", "publish_date": "2025-05-11T06:15:15.707", "last_modified_date": "2025-05-11T06:15:15.707", "base_score": 6.5, "vector": "AV:N/AC:L/Au:S/C:P/I:P/A:P", "cvss_version": "2.0"}, "CVE-2025-4532": {"description": "A vulnerability classified as critical has been found in Shanghai Bairui Information Technology SunloginClient 15.8.3.19819. This affects an unknown part in the library process.dll of the file sunlogin_guard.exe. The manipulation leads to uncontrolled search path. Local access is required to approach this attack. The complexity of an attack is rather high. The exploitability is told to be difficult. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.", "publish_date": "2025-05-11T06:15:16.943", "last_modified_date": "2025-05-11T06:15:16.943", "base_score": 6.0, "vector": "AV:L/AC:H/Au:S/C:C/I:C/A:C", "cvss_version": "2.0"}, "CVE-2025-4533": {"description": "A vulnerability classified as problematic was found in JeecgBoot up to 3.8.0. This vulnerability affects the function unzipFile of the file /jeecg-boot/airag/knowledge/doc/import/zip of the component Document Library Upload. The manipulation of the argument File leads to resource consumption. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used.", "publish_date": "2025-05-11T07:15:15.430", "last_modified_date": "2025-05-11T07:15:15.430", "base_score": 3.3, "vector": "AV:N/AC:L/Au:M/C:N/I:N/A:P", "cvss_version": "2.0"}, "CVE-2025-4534": {"description": "A vulnerability, which was classified as problematic, has been found in SunGrow Logger1000 01_A. This issue affects some unknown processing. The manipulation leads to weak password requirements. The attack may be initiated remotely. The complexity of an attack is rather high. The exploitation is known to be difficult. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.", "publish_date": "2025-05-11T08:15:19.477", "last_modified_date": "2025-05-11T08:15:19.477", "base_score": 2.6, "vector": "AV:N/AC:H/Au:N/C:P/I:N/A:N", "cvss_version": "2.0"}, "CVE-2025-4535": {"description": "A vulnerability, which was classified as problematic, was found in Gosuncn Technology Group Audio-Visual Integrated Management Platform 4.0. Affected is an unknown function of the file /config/config.properties of the component Configuration File Handler. The manipulation leads to information disclosure. It is possible to launch the attack remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.", "publish_date": "2025-05-11T08:15:20.510", "last_modified_date": "2025-05-11T08:15:20.510", "base_score": 5.0, "vector": "AV:N/AC:L/Au:N/C:P/I:N/A:N", "cvss_version": "2.0"}, "CVE-2025-4536": {"description": "A vulnerability has been found in Gosuncn Technology Group Audio-Visual Integrated Management Platform 1.0 and classified as critical. Affected by this vulnerability is an unknown functionality of the file /sysmgr/user/listByPage. The manipulation leads to information disclosure. The attack can be launched remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.", "publish_date": "2025-05-11T09:15:17.287", "last_modified_date": "2025-05-11T09:15:17.287", "base_score": 5.0, "vector": "AV:N/AC:L/Au:N/C:P/I:N/A:N", "cvss_version": "2.0"}, "CVE-2025-4537": {"description": "A vulnerability was found in yangzongzhuan RuoYi-Vue up to 3.8.9 and classified as problematic. Affected by this issue is some unknown functionality of the file ruoyi-ui/jsencrypt.js and ruoyi-ui/login.vue of the component Password Handler. The manipulation leads to cleartext storage of sensitive information in a cookie. The attack may be launched remotely. The complexity of an attack is rather high. The exploitation is known to be difficult. The exploit has been disclosed to the public and may be used.", "publish_date": "2025-05-11T10:15:16.207", "last_modified_date": "2025-05-11T10:15:16.207", "base_score": 2.6, "vector": "AV:N/AC:H/Au:N/C:P/I:N/A:N", "cvss_version": "2.0"}, "CVE-2025-4538": {"description": "A vulnerability was found in kkFileView 4.4.0. It has been classified as critical. This affects an unknown part of the file /fileUpload. The manipulation of the argument File leads to unrestricted upload. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.", "publish_date": "2025-05-11T11:15:50.680", "last_modified_date": "2025-05-11T11:15:50.680", "base_score": 6.5, "vector": "AV:N/AC:L/Au:S/C:P/I:P/A:P", "cvss_version": "2.0"}, "CVE-2025-4539": {"description": "A vulnerability was found in Hainan ToDesk 4.7.6.3. It has been declared as critical. This vulnerability affects unknown code in the library profapi.dll of the component DLL File Parser. The manipulation leads to uncontrolled search path. It is possible to launch the attack on the local host. The complexity of an attack is rather high. The exploitation appears to be difficult. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.", "publish_date": "2025-05-11T11:15:51.273", "last_modified_date": "2025-05-11T11:15:51.273", "base_score": 6.0, "vector": "AV:L/AC:H/Au:S/C:C/I:C/A:C", "cvss_version": "2.0"}, "CVE-2025-4540": {"description": "A vulnerability was found in MTSoftware C-Lodop 6.6.1.1. It has been rated as critical. This issue affects some unknown processing of the component CLodopPrintService. The manipulation leads to unquoted search path. The attack needs to be approached locally. The complexity of an attack is rather high. The exploitation is known to be difficult. The exploit has been disclosed to the public and may be used. Upgrading to version 6.6.13 is able to address this issue. It is recommended to upgrade the affected component.", "publish_date": "2025-05-11T16:15:50.147", "last_modified_date": "2025-05-11T16:15:50.147", "base_score": 6.0, "vector": "AV:L/AC:H/Au:S/C:C/I:C/A:C", "cvss_version": "2.0"}, "CVE-2025-4541": {"description": "A vulnerability classified as critical has been found in LmxCMS 1.41. Affected is the function manageZt of the file c\\admin\\ZtAction.class.php of the component POST Request Handler. The manipulation of the argument sortid leads to sql injection. It is possible to launch the attack remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.", "publish_date": "2025-05-11T16:15:50.760", "last_modified_date": "2025-05-11T16:15:50.760", "base_score": 6.5, "vector": "AV:N/AC:L/Au:S/C:P/I:P/A:P", "cvss_version": "2.0"}, "CVE-2025-4542": {"description": "A vulnerability, which was classified as problematic, has been found in Freeebird Hotel 酒店管理系统 API up to 1.2. Affected by this issue is some unknown functionality of the file /src/main/java/cn/mafangui/hotel/tool/SessionInterceptor.java. The manipulation leads to permissive cross-domain policy with untrusted domains. The attack may be launched remotely. The complexity of an attack is rather high. The exploitation is known to be difficult. The exploit has been disclosed to the public and may be used.", "publish_date": "2025-05-11T18:15:31.327", "last_modified_date": "2025-05-11T18:15:31.327", "base_score": 2.6, "vector": "AV:N/AC:H/Au:N/C:N/I:P/A:N", "cvss_version": "2.0"}, "CVE-2025-4543": {"description": "A vulnerability, which was classified as critical, was found in LyLme Spage 2.1. This affects an unknown part of the file lylme_spage/blob/master/admin/ajax_link.php. The manipulation of the argument sort leads to sql injection. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used.", "publish_date": "2025-05-11T18:15:31.950", "last_modified_date": "2025-05-11T18:15:31.950", "base_score": 7.5, "vector": "AV:N/AC:L/Au:N/C:P/I:P/A:P", "cvss_version": "2.0"}, "CVE-2025-4544": {"description": "A vulnerability was found in D-Link DI-8100 up to 16.07.26A1 and classified as critical. This issue affects some unknown processing of the file /ddos.asp of the component jhttpd. The manipulation of the argument def_max/def_time/def_tcp_max/def_tcp_time/def_udp_max/def_udp_time/def_icmp_max leads to stack-based buffer overflow. The attack may be initiated remotely. The complexity of an attack is rather high. The exploitation is known to be difficult.", "publish_date": "2025-05-11T19:15:50.450", "last_modified_date": "2025-05-11T19:15:50.450", "base_score": 6.8, "vector": "AV:N/AC:H/Au:M/C:C/I:C/A:C", "cvss_version": "2.0"}, "CVE-2025-4545": {"description": "A vulnerability was found in CTCMS Content Management System 2.1.2. It has been classified as critical. Affected is the function del of the file ctcms\\apps\\controllers\\admin\\Tpl.php of the component File Handler. The manipulation of the argument File leads to path traversal. It is possible to launch the attack remotely. The exploit has been disclosed to the public and may be used.", "publish_date": "2025-05-11T20:15:17.917", "last_modified_date": "2025-05-11T20:15:17.917", "base_score": 5.5, "vector": "AV:N/AC:L/Au:S/C:N/I:P/A:P", "cvss_version": "2.0"}, "CVE-2025-4546": {"description": "A vulnerability was found in 1Panel-dev MaxKB up to 1.10.7. It has been declared as critical. Affected by this vulnerability is an unknown functionality of the component Knowledge Base Module. The manipulation leads to csv injection. The attack can be launched remotely. The exploit has been disclosed to the public and may be used. Upgrading to version 1.10.8 is able to address this issue. It is recommended to upgrade the affected component. The vendor was contacted early about this disclosure.", "publish_date": "2025-05-11T20:15:18.107", "last_modified_date": "2025-05-11T20:15:18.107", "base_score": 5.8, "vector": "AV:N/AC:L/Au:M/C:P/I:P/A:P", "cvss_version": "2.0"}, "CVE-2025-4547": {"description": "A vulnerability was found in SourceCodester Web-based Pharmacy Product Management System 1.0. It has been rated as problematic. Affected by this issue is some unknown functionality of the component Add User Page. The manipulation leads to cross site scripting. The attack may be launched remotely. The exploit has been disclosed to the public and may be used. Multiple parameters might be affected.", "publish_date": "2025-05-11T21:15:50.320", "last_modified_date": "2025-05-11T21:15:50.320", "base_score": 3.3, "vector": "AV:N/AC:L/Au:M/C:N/I:P/A:N", "cvss_version": "2.0"}, "CVE-2025-4548": {"description": "A vulnerability classified as critical has been found in Campcodes Online Food Ordering System 1.0. This affects an unknown part of the file /routers/router.php. The manipulation of the argument Username leads to sql injection. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used.", "publish_date": "2025-05-11T22:15:16.987", "last_modified_date": "2025-05-11T22:15:16.987", "base_score": 7.5, "vector": "AV:N/AC:L/Au:N/C:P/I:P/A:P", "cvss_version": "2.0"}, "CVE-2025-4549": {"description": "A vulnerability classified as critical was found in Campcodes Online Food Ordering System 1.0. This vulnerability affects unknown code of the file /routers/register-router.php. The manipulation of the argument Name leads to sql injection. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used.", "publish_date": "2025-05-11T22:15:17.163", "last_modified_date": "2025-05-11T22:15:17.163", "base_score": 7.5, "vector": "AV:N/AC:L/Au:N/C:P/I:P/A:P", "cvss_version": "2.0"}, "CVE-2025-4550": {"description": "A vulnerability, which was classified as critical, has been found in PHPGurukul Apartment Visitors Management System 1.0. This issue affects some unknown processing of the file /admin/pass-details.php. The manipulation of the argument pid leads to sql injection. The attack may be initiated remotely. The exploit has been disclosed to the public and may be used.", "publish_date": "2025-05-11T23:15:49.807", "last_modified_date": "2025-05-11T23:15:49.807", "base_score": 7.5, "vector": "AV:N/AC:L/Au:N/C:P/I:P/A:P", "cvss_version": "2.0"}, "CVE-2025-4551": {"description": "A vulnerability, which was classified as problematic, was found in ContiNew Admin up to 3.6.0. Affected is an unknown function of the file /dev-api/common/file. The manipulation of the argument File leads to cross site scripting. It is possible to launch the attack remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.", "publish_date": "2025-05-11T23:15:49.977", "last_modified_date": "2025-05-11T23:15:49.977", "base_score": 4.0, "vector": "AV:N/AC:L/Au:S/C:N/I:P/A:N", "cvss_version": "2.0"}, "CVE-2025-4552": {"description": "A vulnerability has been found in ContiNew Admin up to 3.6.0 and classified as problematic. Affected by this vulnerability is an unknown functionality of the file /dev-api/system/user/1/password. The manipulation leads to unverified password change. The attack can be launched remotely. The exploit has been disclosed to the public and may be used. The vendor was contacted early about this disclosure but did not respond in any way.", "publish_date": "2025-05-12T00:15:16.450", "last_modified_date": "2025-05-12T00:15:16.450", "base_score": 5.5, "vector": "AV:N/AC:L/Au:S/C:N/I:P/A:P", "cvss_version": "2.0"}, "CVE-2025-4553": {"description": "A vulnerability was found in PHPGurukul Apartment Visitors Management System 1.0 and classified as critical. Affected by this issue is some unknown functionality of the file /admin/bwdates-reports-details.php. The manipulation of the argument fromdate/todate leads to sql injection. The attack may be launched remotely. The exploit has been disclosed to the public and may be used.", "publish_date": "2025-05-12T01:15:54.137", "last_modified_date": "2025-05-12T01:15:54.137", "base_score": 7.5, "vector": "AV:N/AC:L/Au:N/C:P/I:P/A:P", "cvss_version": "2.0"}, "CVE-2025-4554": {"description": "A vulnerability was found in PHPGurukul Apartment Visitors Management System 1.0. It has been classified as critical. This affects an unknown part of the file /admin/bwdates-passreports-details.php. The manipulation of the argument fromdate/todate leads to sql injection. It is possible to initiate the attack remotely. The exploit has been disclosed to the public and may be used.", "publish_date": "2025-05-12T01:15:54.777", "last_modified_date": "2025-05-12T01:15:54.777", "base_score": 7.5, "vector": "AV:N/AC:L/Au:N/C:P/I:P/A:P", "cvss_version": "2.0"}, "CVE-2025-4555": {"description": "The web management interface of Okcat Parking Management Platform from ZONG YU has a Missing Authentication vulnerability, allowing unauthenticated remote attackers to directly access system functions. These functions include opening gates, viewing license plates and parking records, and restarting the system.", "publish_date": "2025-05-12T03:15:16.337", "last_modified_date": "2025-05-12T03:15:16.337", "base_score": 9.8, "vector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H", "cvss_version": "3.1"}, "CVE-2025-4556": {"description": "The web management interface of Okcat Parking Management Platform from ZONG YU has an Arbitrary File Upload vulnerability, allowing unauthenticated remote attackers to upload and execute web shell backdoors, thereby enabling arbitrary code execution on the server.", "publish_date": "2025-05-12T03:15:17.363", "last_modified_date": "2025-05-12T03:15:17.363", "base_score": 9.8, "vector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H", "cvss_version": "3.1"}, "CVE-2025-4557": {"description": "The specific APIs of Parking Management System from ZONG YU has a Missing Authentication vulnerability, allowing unauthenticated remote attackers to access specific APIs and operate system functions. These functions include opening gates and restarting the system.", "publish_date": "2025-05-12T03:15:17.530", "last_modified_date": "2025-05-12T04:15:30.043", "base_score": 9.1, "vector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:H/A:H", "cvss_version": "3.1"}, "CVE-2025-4558": {"description": "The GPM from WormHole Tech has an Unverified Password Change vulnerability, allowing unauthenticated remote attackers to change any user's password and use the modified password to log into the system.", "publish_date": "2025-05-12T04:15:35.160", "last_modified_date": "2025-05-12T04:15:35.160", "base_score": 9.8, "vector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H", "cvss_version": "3.1"}, "CVE-2025-3597": {"description": "The Firelight Lightbox WordPress plugin before 2.3.15 does not prevent users with post writing capabilities from executing arbitrary Javascript when the jQuery Metadata library is enabled. While this feature is meant to only be available to Pro version users, it can be activated in the free version too, making it theoretically exploitable there as well.", "publish_date": "2025-05-12T06:15:39.030", "last_modified_date": "2025-05-12T06:15:39.030", "base_score": null, "vector": null, "cvss_version": null}, "CVE-2025-3649": {"description": "The LightPress Lightbox WordPress plugin before 2.3.4 does not check download links point to valid, non-Javascript URLs, allowing users with at least the contributor role to conduct Stored XSS attacks.", "publish_date": "2025-05-12T06:15:40.270", "last_modified_date": "2025-05-12T06:15:40.270", "base_score": null, "vector": null, "cvss_version": null}, "CVE-2025-4559": {"description": "The ISOinsight from Netvision has a SQL Injection vulnerability, allowing unauthenticated remote attackers to inject arbitrary SQL commands to read, modify, and delete database contents.", "publish_date": "2025-05-12T06:15:40.750", "last_modified_date": "2025-05-12T06:15:40.750", "base_score": 9.8, "vector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H", "cvss_version": "3.1"}, "CVE-2025-4560": {"description": "The ISOinsight from Netvision has a Missing Authentication vulnerability, allowing unauthenticated remote attackers to access certain system functions. These functions include viewing the administrator list, viewing and editing IP settings, and uploading files.", "publish_date": "2025-05-12T07:15:47.463", "last_modified_date": "2025-05-12T07:15:47.463", "base_score": 6.5, "vector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:N", "cvss_version": "3.1"}, "CVE-2025-4561": {"description": "The KFOX from KingFor has an Arbitrary File Upload vulnerability, allowing remote attackers with regular privilege to upload and execute web shell backdoors, thereby enabling arbitrary code execution on the server.", "publish_date": "2025-05-12T07:15:48.557", "last_modified_date": "2025-05-12T07:15:48.557", "base_score": 8.8, "vector": "CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H", "cvss_version": "3.1"}, "CVE-2025-3496": {"description": "An unauthenticated remote attacker can cause a buffer overflow which could lead to unexpected behaviour or DoS via Bluetooth or RS-232 interface.", "publish_date": "2025-05-12T08:15:19.537", "last_modified_date": "2025-05-12T08:15:19.537", "base_score": 7.5, "vector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H", "cvss_version": "3.1"}, "CVE-2025-41393": {"description": "Reflected cross-site scripting vulnerability exists in the laser printers and MFPs (multifunction printers) which implement Ricoh Web Image Monitor. If exploited, an arbitrary script may be executed on the web browser of the user who accessed Web Image Monitor. As for the details of affected product names and versions, refer to the information provided by the vendor under [References].", "publish_date": "2025-05-12T08:15:19.733", "last_modified_date": "2025-05-12T08:15:19.733", "base_score": 6.1, "vector": "CVSS:3.0/AV:N/AC:L/PR:N/UI:R/S:C/C:L/I:L/A:N", "cvss_version": "3.0"}}